tutorials/fluidSolidInteraction/beamInCrossFlow.quasiMono/system/functions
functions
{
    forces
    {
        type                forces;
        region              fluid;
        libs                ( "libforces.so" );
        writeControl        timeStep;
        writeInterval       1;
        patches             (interface);
        "pName|p"           p;
        "UName|U"           U;
        "rhoName|rho"       rhoInf;
        log                 false;
        rhoInf              1000;
        CofR                (0.5 0.1 0);
    }
    displacement
    {
        type                solidPointDisplacement;
        point               (0.45 0.15 -0.15);
    }
}
